{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 8], "dtype": "float32", "units": 32, "activation": "relu", "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "activation": "relu", "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "activation": "relu", "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_3", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_4", "activity_regularizer": null}}], "name": "sequential_1"}}