{"config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 8], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 32}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 16}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 16}, "class_name": "Dense"}, {"config": {"name": "dense_4", "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 8}, "class_name": "Dense"}, {"config": {"name": "dense_5", "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 1}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}